{   
    "Evert.AI": {
        "description": [
            "A block-based developer environment to experiment with automatically generated code (program synthesis)."
        ],
        "date": "",
        "url": "",
        "tags": [],
        "archived": false,
        "active": true,
        "github": false,
        "website": false
    },
    "Terminal": {
        "description": [
            "A browser-based stock market data dashboard with customizable interface. The goal is to create a highly customizable and developer-like environment for financial professionals. Interesting future work include exploring user-driven approaches to generate web layouts, such as SQL-like language or using prompts in natural language."
        ],
        "date": "2020-",
        "url": "https://terminal.frozenfork.com",
        "tags": [],
        "archived": false,
        "active": true,
        "github": false,
        "website": false
    },
    "raknalang (räknalang)": {
        "description": [
            "An interpreter and REPL to do arithmetic in natural languages, such as English or Swedish. The goal is to provide a programmatic way to express simple calculation and conditional problems like it would be expressed in native language."
        ],
        "date": "2021",
        "url": "https://github.com/michaelsjoeberg/raknalang",
        "tags": [],
        "archived": false,
        "active": true,
        "github": false,
        "website": false
    },
    "pas2wat (pascal-to-wat)": {
        "description": [
            "A compiler to translate subset of Pascal into WebAssembly text-format. The goal is to develop a modular and extendable compiler architecture in Rust, and to explore compatibility issues when translating legacy programming languages to web native languages. Interesting future work include handling files, read-write operations, and memory management."
        ],
        "date": "2020-",
        "url": "https://github.com/michaelsjoeberg/pas2wat",
        "tags": [],
        "archived": false,
        "active": true,
        "github": false,
        "website": false
    },
    "EQZEN": {
        "description": [
            "A browser-based collaborative financial portfolio management application. The goal was to explore use cases around security and collaboration in financial management and to improve workflow for financial advisors working with many clients. Discontinued."
        ],
        "date": "2018-2020",
        "url": "",
        "tags": [],
        "archived": false,
        "active": false,
        "github": false,
        "website": false
    },
    "Give Trees": {
        "description": [
            "Mobile application to plant trees published by Plant for Earth LTD (co-founder, dissolved). Discontinued."
        ],
        "date": "2014-2017",
        "url": "",
        "tags": [],
        "archived": false,
        "active": false,
        "github": false,
        "website": false
    },
    "learnhub.io": {
        "description": [
            "A web-based skill tracker and social platform for self-learners. The goal was to create a community of self-learners that want to create and share pathways/ online curriculums to learn specific topics. A pathway was a curated list of available-online courses, such as MOOCs."
        ],
        "date": "2018",
        "url": "https://github.com/michaelsjoeberg/learnhub.io",
        "tags": [],
        "archived": true,
        "active": false,
        "github": false,
        "website": false
    },
    "doolio.co": {
        "description": ["An interactive resume. The goal was to learn PHP."],
        "date": "2017",
        "url": "https://github.com/michaelsjoeberg/doolio.co",
        "tags": [],
        "archived": true,
        "active": false,
        "github": false,
        "website": false
    }
}
